import HomeNavbar from "@/components/Navbar/HomeNavbar/HomeNavbar";
import { APP_NAME, TUMGIN_EMAIL } from "@/utils/constant";
import Link from "next/link";
import React from "react";

const HOST = process.env.NEXT_PUBLIC_HOST;

type PrivacyPolicyType = {
  title: string;
  desc1: string;
  list1?: string[];
  desc2?: string;
  list2?: string[];
};

//TODO: Update before deploy

const PRIVACY_POLICY_LIST: PrivacyPolicyType[] = [
  {
    title: "การเก็บรวบรวมข้อมูลส่วนบุคคล",
    desc1:
      "ประเภทข้อมูลที่เราเก็บ จะขึ้นอยู่กับคุณใช้บริการบนเว็บไซต์เราอย่างไร หากคุณเป็นแค่ผู้เข้าชมเว็บไซต์ คุณแทบจะไม่ต้องให้ข้อมูลใดๆกับเรา ยกเว้นแค่การเก็บคุกกี้เท่านั้น แต่คุณก็สามารถใช้บริการเว็บไซต์เราอย่างจำกัดเช่นกัน ซึ่งบริการส่วนใหญ่ ผู้ใช้จำเป็นที่จะต้องเข้าสู่ระบบของทางเว็บไซต์ก่อนเพื่อใช้บริการได้อย่างเต็มประสิทธิภาพ ข้อมูลที่เราจำเป็นต้องใช้มีดังนี้",
    list1: [
      "<b>ข้อมูลส่วนตัว</b> เป็นข้อมูลใช้เพื่อระบุตัวตนของคุณ เช่น อีเมล, ชื่อผู้ใช้, เพศ, วันเดือนปีเกิด, รูปโปรไฟล์, บัญชีผู้ใช้โซเชียลมีเดีย",
      "<b>ข้อมูลที่ไม่ใช่ข้อมูลส่วนบุคคล</b> เป็นข้อมูลที่ไม่ได้ระบุตัวตนของคุณ เช่น IP address",
    ],
    desc2:
      "เราเก็บรวบรวมข้อมูลเหล่านี้ผ่านหลายวิธี เช่น ผ่านการกรอกแบบฟอร์มของคุณ ผ่านทางคุกกี้ และเทคโนโลยีการติดตามอื่นๆ",
  },
  {
    title: "วิธีในการนำข้อมูลส่วนบุคคลไปใช้",
    desc1:
      "เราใช้ข้อมูลข้องคุณทั้งข้อมูลส่วนตัวและข้อมูลที่ไม่ใช่ข้อมูลส่วนบุคคลตามวัตถุประสงค์ดังนี้",
    list1: [
      "<b>เพื่อพัฒนาเว็บไซต์และบริการ</b> เราใช้ข้อมูลของคุณเพื่อทำความเข้าใจวิธีการใช้งานหรือพฤติกรรมของคุณบนเว็บไซต์และบริการเพื่อนำไปปรับปรุง พัฒนา และแก้ไขให้ดียิ่งขึ้น รวมถึงนำไปวิเคราะห์เพื่อมอบประสบการณ์ที่ดีที่สุดสำหรับคุณ เช่น การนำไปพัฒนาให้แนะนำสูตรอาหารในแบบที่คุณชอบ เพื่อให้ตรงใจกับคุณมากขึ้น และประหยัดเวลาในการค้นหา ตลอดจนไปถึงหาแรงบันดาลใจ",
      "<b>เพื่อสื่อสารกับคุณ</b> เราใช้ข้อมูลเพื่อสื่อสารกับคุณเกี่ยวกับเว็บไซต์และบริการของเรา รวมถึงแจ้งถึงการปรับปรุงเว็บไซต์ และสื่อการตลาดให้คุณ",
      "<b>เพื่อเพื่อปกป้องสิทธิและผลประโยชน์ของเรา</b> เราใช้ข้อมูลของคุณเพื่อปกป้องสิทธิ์และผลประโยชน์ของเรา รวมถึงเพื่อบังคับใช้ข้อกำหนดในการให้บริการของเรา และเพื่อป้องกันการฉ้อโกงและการละเมิด",
    ],
  },
  {
    title: "จดหมายข่าวสาร",
    desc1:
      "เรานำเสนอจดหมายข่าวสารอิเล็กทรอนิกส์ซึ่งท่านสามารสมัครใจที่จะสมัครได้ตลอดเวลา เราให้คำมั่นว่าจะรักษาที่อยู่อีเมลของท่านไว้ให้เป็นความลับและจะไม่ทำการเปิดเผยที่อยู่อีเมลของท่านให้กับบุคคลที่สามเว้นแต่ได้รับอนุญาตเอาไว้ในส่วนของการใช้ข้อมูลและการประมวลผลหรือเพื่อวัตถุประสงค์ในการใช้ผู้ให้บริการบุคคลที่สามในการส่งอีเมลดังกล่าว เราจะเก็บรักษาข้อมูลที่ส่งทางอีเมลตามกฎหมายและข้อบังคับที่บังคับใช้",
    desc2:
      "อีเมลทั้งหมดที่ส่งจากเราจะระบุอย่างชัดเจนว่าอีเมลนั้นมาจากใครและให้ข้อมูลที่ชัดเจนเกี่ยวกับวิธีการติดต่อผู้ส่ง ท่านอาจเลือกที่จะหยุดรับจดหมายข่าวหรืออีเมลการตลาดของเราโดยทำตามคำแนะนำในการยกเลิกการสมัครที่รวมอยู่ในอีเมลเหล่านี้หรือติดต่อเรา อย่างไรก็ตาม ท่านจะยังคงได้รับอีเมลเกี่ยวกับธุรกรรมที่จำเป็น",
  },
  {
    title: "คุกกี้ (Cookies)",
    desc1:
      "เราใช้คุกกี้และเทคโนโลยีที่คล้ายๆกันเพื่อเก็บและใช้ข้อมูลส่วนตัวเกี่ยวกับคุณ เช่น IP address เพื่อช่วยให้เราพัฒนาเว็บไซต์และบริการ การใช้เว็บไซต์และบริการของเรา คุณจำเป็นยินยอมให้ใช้คุกกี้ตามนโยบายนี้ หากคุณไม่เห็นด้วยกับการใช้คุกกี้ คุณควรปรับการตั้งค่าเบราว์เซอร์หรือสามารถปรับแต่งคุกกี้ได้ในอนาคตหรือไม่ใช้เว็บไซต์และบริการของเรา เพราะเว็บไซต์และบริการของเราจำเป็นอย่างยิ่งที่จะต้องใช้คุกกี้เพื่อเข้าถึงเนื้อหาต่างๆ",
  },
  {
    title: "คุกกี้คืออะไร",
    desc1:
      "คุกกี้ (Cookies) เป็นไฟล์ข้อมูลที่เป็นตัวอักษรซึ่งถูกจัดเก็บบนเครื่องคอมพิวเตอร์ของผู้ใช้เมื่อเข้าชมเว็บไซต์ ไฟล์ข้อความนี้เก็บรวบรวมข้อมูลที่สามารถอ่านได้ด้วยเว็บไซต์เมื่อมีการเข้าเว็บไซต์อีกครั้งในเวลาต่อมา โดยคุกกี้เหล่านี้บางส่วนมีความจำเป็น ไม่เช่นนั้นแล้วเว็บไซต์จะไม่สามารถทำงานได้อย่างสมบูรณ์ ส่วนคุกกี้ประเภทอื่นๆ ยังให้ความสะดวกสบายแก่ผู้เข้าชมเว็บไซต์ เนื่องจากมีการจดจำชื่อผู้ใช้ด้วยวิธีที่มีความปลอดภัย และยังจดจำภาษาที่ใช้ ตัวอย่างเช่น คุกกี้ทำให้ผู้ใช้ไม่จำเป็นต้องกรอกข้อมูลเดิมในแต่ละครั้งที่ผู้ใช้เข้าเว็บไซต์",
  },
  {
    title: "คุกกี้ที่เราใช้",
    desc1: "ประเภทของคุกกี้ที่เราใช้บนเว็บไซต์ มีดังนี้",
    list1: [
      "<b>คุกกี้ที่จำเป็น (Essential cookies)</b> คุกกี้เหล่านี้จำเป็นสำหรับการทำงานของเว็บไซต์และบริการของเรา ซึ่งรวมถึงคุกกี้ที่ช่วยให้คุณสามารถเข้าสู่ระบบ เพื่อเข้าถึงเนื้อหาและเข้าถึงความปลอดภัยต่างๆของเว็บไซต์ของเรา",
      "<b>คุกกี้เพื่อการวิเคราะห์ (Analytical cookies)</b> คุกกี้เหล่านี้ช่วยให้เราสามารถรวบรวมและวิเคราะห์ข้อมูลทางสถิติเกี่ยวกับการใช้งานเว็บไซต์และบริการของเรา สิ่งนี้ช่วยให้เราปรับปรุงประสิทธิภาพและประสบการณ์ผู้ใช้",
      "<b>คุกกี้ใช้เพือการโฆษณา (Advertising cookies)</b> คุกกี้เหล่านี้ใช้เพื่อแสดงโฆษณาที่เกี่ยวข้องแก่คุณบนเว็บไซต์ของเราและบนเว็บไซต์อื่นๆ พวกเขาอาจติดตามประวัติการเข้าชมของคุณและใช้ข้อมูลนี้เพื่อแสดงโฆษณาที่ตรงเป้าหมายแก่คุณ",
    ],
  },
  {
    title: "จัดการคุกกี้อย่างไรได้บ้าง",
    desc1:
      "คุณสามารถปรับการตั้งค่าคุกกี้ของคุณผ่านการตั้งค่าเบราว์เซอร์ของคุณ เบราว์เซอร์ส่วนใหญ่อนุญาตให้คุณบล็อกหรือลบคุกกี้ หรือรับการแจ้งเตือนเมื่อมีการตั้งค่าคุกกี้ใหม่",
    desc2:
      "สำหรับข้อมูลเพิ่มเติมเกี่ยวกับวิธีปรับการตั้งค่าคุกกี้ โปรดดูเอกสารวิธีใช้ของเบราว์เซอร์ของคุณ",
  },
  {
    title: "การปกป้องและรักษาความปลอดภัยของข้อมูลส่วนบุคคล",
    desc1:
      "เราใช้ขั้นตอนที่เหมาะสมในการปกป้องข้อมูลส่วนบุคคลและไม่ใช่ข้อมูลส่วนบุคคลของคุณจากการเข้าถึง การใช้ หรือการเปิดเผยโดยไม่ได้รับอนุญาต อย่างไรก็ตาม เราไม่สามารถรับประกันความปลอดภัยของข้อมูลของคุณได้ และคุณควรดำเนินการตามขั้นตอนเพื่อปกป้องความเป็นส่วนตัวของคุณเองด้วย",
  },
  {
    title: "การเปลี่ยนแปลงนโยบายนี้",
    desc1:
      "เราอาจปรับปรุงนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว หากเราทำการเปลี่ยนแปลงที่สำคัญ เราจะแจ้งให้คุณทราบผ่านทางเว็บไซต์ของเราหรือด้วยวิธีอื่นๆ",
  },
  {
    title: "ติดต่อเรา",
    desc1: `หากคุณมีคำถามหรือข้อสงสัยเกี่ยวกับนโยบายความเป็นส่วนตัวของเรา โปรดติดต่อที่ <a href="${TUMGIN_EMAIL}" class="link--underline">${TUMGIN_EMAIL}</a>`,
  },
];

const PrivacyPolicy = () => {
  return (
    <div className="mb-8">
      <HomeNavbar />
      <h1 className="mt-4">นโยบายความเป็นส่วนตัว</h1>
      <p className="mt-2 mb-3">
        เรา (`ทีมงาน {APP_NAME}`) รู้ว่าคุณ (`ผู้ใช้`)
        ใส่ใจและให้ความสำคัญกับข้อมูลของคุณที่จะถูกนำเอาไปใช้เป็นอย่างมาก
        นโยบายความเป็นส่วนตัว (`นโยบาย`) นี้จึงอธิบายว่าทำไม Tumgin (`เว็บไซต์`)
        ถึงเก็บรวบรวม ใช้ และเปิดเผยข้อมูลส่วนตัวของผู้ใช้
        เมื่อผู้ใช้ใช้บริการบนเว็บไซต์{" "}
        <Link href={HOST || ""} className="link--underline">
          {HOST}
        </Link>{" "}
        และเราเก็บ ใช้ และเปิดเผยข้อมูลเหล่านั้นอย่างไรบ้าง
      </p>

      {PRIVACY_POLICY_LIST.map((pp, index) => (
        <React.Fragment key={`privacy-policy--${index}`}>
          <h2 className="mt-4">{pp.title}</h2>
          <p className="my-2" dangerouslySetInnerHTML={{ __html: pp.desc1 }} />
          <ul className="list-disc ml-7">
            {pp.list1 &&
              pp.list1.map((item, itemIndex) => (
                <li
                  key={`privacy-policy--${index}__list--${itemIndex}`}
                  className="mb-1"
                  dangerouslySetInnerHTML={{ __html: item }}
                />
              ))}
          </ul>
          {pp.desc2 && (
            <p
              className="my-2"
              dangerouslySetInnerHTML={{ __html: pp.desc2 }}
            />
          )}
        </React.Fragment>
      ))}
    </div>
  );
};

export default PrivacyPolicy;
