import HomeNavbar from "@/components/Navbar/HomeNavbar/HomeNavbar";
import React from "react";

const TERM_OF_SERVICE_LIST = [
  {
    title: "บัญชีผู้ใช้",
    desc1:
      "เมื่อคุณสร้างบัญชีกับเรา คุณต้องให้ข้อมูลที่ถูกต้องและครบถ้วนแก่เรา คุณจำเป็นต้องรับผิดชอบในการปกป้องบัญชีของคุณ ดังนั้นโปรดใช้รหัสผ่านที่รัดกุมและจำกัดการใช้งานเฉพาะบัญชีนี้ เราไม่สามารถและจะไม่รับผิดชอบต่อความสูญเสียหรือความเสียหายใดๆ ที่เกิดขึ้นจากการที่คุณไม่ปฏิบัติตามข้อกำหนดข้างต้น",
  },
  {
    title: "เนื้อหาของผู้ใช้",
    desc1:
      "คุณต้องรับผิดชอบต่อเนื้อหาที่คุณโพสต์บนหรือผ่านบริการ รวมถึงความถูกต้องตามกฎหมาย ความน่าเชื่อถือ และความเหมาะสม โดยการโพสต์เนื้อหาบนเว็บไซต์ แสดงว่าคุณให้สิทธิ์และใบอนุญาตแก่เราในการใช้ แก้ไข ดำเนินการต่อสาธารณะ แสดงต่อสาธารณะ ทำซ้ำ และแจกจ่ายเนื้อหาดังกล่าวบนเว็บไซต์ อย่างไรก็ตาม ท่านให้สิทธิแก่เราในการเข้าถึง คัดลอก แจกจ่าย จัดเก็บ ส่ง จัดรูปแบบใหม่และแสดงเนื้อหาของบัญชีผู้ใช้ของท่านตามที่กำหนดไว้สำหรับวัตถุประสงค์ในการให้บริการแก่ท่านเท่านั้น เราขอสงวนสิทธิในการปฏิเสธหรือลบเนื้อหาใดๆ ที่ละเมิดนโยบายของเรา ไม่เหมาะสม หรือเป็นอันตรายในทางใดทางหนึ่งต่อข้อกำหนดและเงื่อนไขตามดุลยพินิจของเราโดยไม่เป็นการจำกัดการรับรองและการรับประกันที่เราได้กำหนดไว้",
  },
  {
    title: "การใช้บริการของคุณ",
    desc1:
      "คุณตกลงที่จะใช้บริการเพื่อวัตถุประสงค์ที่ถูกต้องตามกฎหมาย เหมาะสม และสอดคล้องกับข้อกำหนดเหล่านี้และกฎหมายหรือข้อบังคับที่เกี่ยวข้องเท่านั้น คุณตกลงที่จะไม่มีส่วนร่วมในกิจกรรมใดๆ ที่รบกวนหรือรบกวนบริการหรือเซิร์ฟเวอร์หรือเครือข่ายที่เชื่อมต่อกับบริการ คุณไม่สามารถใช้บริการเพื่อวัตถุประสงค์ที่ผิดกฎหมายหรือไม่ได้รับอนุญาต",
  },
  {
    title: "ทรัพย์สินทางปัญญา",
    desc1:
      "บริการและเนื้อหา คุณลักษณะ และฟังก์ชันการทำงานเดิมเป็นและจะยังคงเป็นทรัพย์สินเฉพาะของทีมงาน Tumgin และผู้ออกใบอนุญาต ห้ามใช้เครื่องหมายการค้าและเครื่องหมายการค้าของเราร่วมกับผลิตภัณฑ์หรือบริการใดๆ โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากทีมงาน Tumgin",
  },
  {
    title: "การสงวนสิทธิ์ในการเข้าถึง",
    desc1:
      "เราขอสงวนสิทธิ์ในการเข้าถึงบริการหรือเว็บไซต์ที่เกี่ยวข้องของคุณไม่ว่าด้วยเหตุผลใดก็ตาม โดยไม่ต้องแจ้งให้ทราบล่วงหน้าและไม่ต้องรับผิดต่อคุณ ",
  },
  {
    title: "การจำกัดความรับผิดชอบ",
    desc1:
      "เราไม่รับผิดชอบต่อความเสียหาย ความสูญเสีย หรือ ค่าใช้จ่ายที่เกิดขึ้นจากการใช้บริการของเว็บไซต์ ระบบภายนอกที่เชื่อมโยงกับเรา โดยรวมถึงความไม่ถูกต้อง, ความล่าช้าของการรับส่งข้อมูล, ระยะเวลา หรือ เหตุขัดข้องของการเชื่อมต่อ ความเสถียรของระบบ จนถึง ไวรัส และ มัลแวร์คอมพิวเตอร์",
  },
  {
    title: "การสงวนสิทธิในการรับประกัน",
    desc1:
      "เราไม่รับรองหรือรับประกันใดๆ ไม่ว่าโดยชัดแจ้งหรือโดยปริยายเกี่ยวกับการทำงานของบริการหรือข้อมูล เนื้อหา วัสดุ หรือผลิตภัณฑ์ที่รวมอยู่ในบริการ คุณตกลงโดยชัดแจ้งว่าการใช้บริการของคุณเป็นความเสี่ยงของคุณแต่เพียงผู้เดียว ในขอบเขตสูงสุดที่กฎหมายที่ใช้บังคับอนุญาต เราขอปฏิเสธการรับประกันทั้งหมด ไม่ว่าโดยชัดแจ้งหรือโดยปริยาย เราไม่รับประกันว่าบริการ เซิร์ฟเวอร์ หรืออีเมลที่ส่งจากเรานั้นปราศจากไวรัสหรือส่วนประกอบที่เป็นอันตรายอื่นๆ ",
  },
  {
    title: "การเชื่อมโยงเว็บไซต์ภายนอก",
    desc1:
      "เว็บไซต์อาจจัดให้มีการเชื่อมต่อไปยังเว็บไซต์ หรือ บริการอื่นๆ  จากบริษัทภายนอกเพื่อใช้งานฟังก์ชันการทำงานบางอย่าง ไม่ว่าจะเป็นส่วนประมวลผล หรือ การแสดงผล ซึ่งทางเรา ขอไม่รับรองความปลอดภัยในการเชื่อมต่อดังกล่าว เนื่องจากทางเราไม่สามารถตรวจสอบความถูกต้อง และ ความปลอดภัยของบริการภายนอกได้ทั้งหมด และ ไม่ขอรับผิดชอบค่าเสียหายใดๆ ที่เกิดขึ้นจากบริการนั้นๆ",
  },
  {
    title: "การเปลี่ยนแปลง",
    desc1:
      "เราขอสงวนสิทธิ์ตามดุลยพินิจของเราแต่เพียงผู้เดียวในการแก้ไขหรือแทนที่ข้อกำหนดเหล่านี้ได้ตลอดเวลา หากการแก้ไขมีความสำคัญ เราจะพยายามแจ้งล่วงหน้าอย่างน้อย 30 วันก่อนที่ข้อกำหนดใหม่จะมีผลบังคับใช้ สิ่งที่ก่อให้เกิดการเปลี่ยนแปลงในสาระสำคัญจะขึ้นอยู่กับดุลยพินิจของเราแต่เพียงผู้เดียว",
  },
  {
    title: "กฎหมายที่ใช้บังคับ",
    desc1:
      "การใช้บริการเว็บไซต์นี้หรือการตีความข้อตกลงและเงื่อนไขการใช้บริการเว็บไซต์นี้ให้เป็นไปตามกฎหมายไทย",
  },
];

const TermsOfService = () => {
  return (
    <div className="mb-8">
      <HomeNavbar />
      <h1 className="mt-4">ข้อตกลงและเงื่อนไขการใช้บริการ</h1>
      <p className="mt-2 mb-3">
        ข้อกำหนดและเงื่อนไขในการใช้งานฉบับนี้ (`ข้อกำหนดและเงื่อนไขฯ` หรือ
        `สัญญา`) เป็นข้อตกลงระหว่าง Tumgin (`ทีมงาน Tumgin` หรือ `เรา`) และคุณ
        (`ผู้ใช้` หรือ `คุณ`)
        สัญญาฉบับนี้ได้กำหนดข้อกำหนดและเงื่อนไขทั่วไปสำหรับการใช้งาน Tumgin
        ผลิตภัณฑ์หรือบริการ และการเข้าร่วมกิจกรรมที่เกี่ยวข้องกับ Tumgin ใดๆ
        ก็ตามของคุณ (เรียกรวมกันว่า `เว็บไซต์` หรือ `บริการ`)
      </p>

      {TERM_OF_SERVICE_LIST.map((tos, index) => (
        <React.Fragment key={`terms-of-service--${index}`}>
          <h2 className="mt-4">{tos.title}</h2>
          <p className="my-2" dangerouslySetInnerHTML={{ __html: tos.desc1 }} />
        </React.Fragment>
      ))}
    </div>
  );
};

export default TermsOfService;
